doc/default.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:t f:t inline:t num:t p:nil pri:nil prop:nil
#+OPTIONS: stat:t tags:t tasks:t tex:t timestamp:t toc:t todo:t |:t
#+AUTHOR: H. Dieter Wilhelm
#+EMAIL: dieter@duenenhof-wilhelm.de
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.2.10)
#+OPTIONS: html-link-use-abs-url:nil html-postamble:t html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+HTML_LINK_HOME: https://github.com/dieter-wilhelm/ansys-mode
#+HTML_LINK_UP: ../index.html
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)
#+LATEX_HEADER:
#+TITLE: Customisation of ANSYS-Mode
#+text: Copyright (C) 2006 - 2015 H. Dieter Wilhelm GPL V3

* Introduction
Customisations for GNU-Linux and Windows systems.

All the following code examples you will find in the file
/default.el/, which can be used as the configuration file for
ANSYS-Mode (after moving it e. g. to [[/usr/share/emacs/site-lisp]] or
[[c:\\EMACSINSTALLDIR\\site-lisp\\]]).  Yet this file is loaded *after*
Emacs' user configuration file [[~/.emacs]] (or [[~/.emacs.el]] or
[[~/.emacs.d/init.el]], if any)!  When you intend to change any of the
following settings either with

1) Emacs' customisation system or
2) changing them directly in your user configuration file,

then you *must* either set the variable ~inhibit-default-init~ to ~t~
like in the following line
#+BEGIN_SRC emacs-lisp
(setq inhibit-default-init t)
#+END_SRC
in your configuration file or remove or rename /default.el/ (or at
least its corresponding sections) otherwise clashing settings in
/.emacs/ will be overwritten!

* Conventions used in /default.el/

The comment sign in Emacs lisp is ~;~ (one semi-colon `;').  Textual
hints in /default.el/ are indicated with DOUBLE semi-colons ~;;~,
please uncomment there code lines with a SINGLE comment sign, when
appropriate.

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
;; Customisation file for ANSYS-Mode (GNU-Linux and Windows)

;; Copyright (C) 2006 - 2015 H. Dieter Wilhelm GPL V3

;; !!! `default.el' can be used as a configuration file (after moving
;; it e. g. to `/usr/share/emacs/site-lisp' or
;; `c:\\EMACS_INSTALLDIR\\site-lisp').  Yet this file is then loaded
;; AFTER Emacs' user configuration file `~/.emacs' (or `~/.emacs.el'
;; or `~/.emacs.d/init.el')!  If you intend to change the following
;; settings with 1) Emacs' customisation system or 2) changing them
;; directly in your configuration file, you MUST either set the
;; variable `inhibit-default-init' to `t' "(setq inhibit-default-init
;; t)" in your configuration file or remove or rename `default.el' (or
;; at least its corresponding sections) otherwise clashing settings in
;; `.emacs' will be overwritten!!!

;;; CONVENTIONS

;; The comment sign is `;' (one semi-colon ;) Textual hints are
;; indicated with DOUBLE semi-colons `;;', optionally uncomment the
;; code lines with a SINGLE comment sign.
#+END_SRC

* Important Prerequisites
** Finding ANSYS-Mode
If the ANSYS-Mode files (the files with the suffix /.el/) are *not*
placed in a default Emacs load path.  Please see the variable
load-path .

#+BEGIN_SRC emacs-lisp
(describe-variable 'load-path)
#+END_SRC

Or you can read about the load-path in the Emacs manual:
#+BEGIN_SRC emacs-lisp
(info "(emacs)Lisp Libraries")
#+END_SRC

Then it is necessary to adjust the following way: Hint: The
directory site-lisp/ in the Emacs installation tree, for example, is
in its default load path.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "C:\\DIRECTORY-PATH\\WHERE\\THE\\ANSYS-MODE\\FILES\\RESIDE")
#+END_SRC
for example:
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "c:\\emacs\\ansys-mode")
#+END_SRC
for a Windows system or
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "/usr/local/src/emacs/ansys-mode")
#+END_SRC
for a GNU-Linux system.
