doc/default.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Customisation of ANSYS-Mode</title>
<!-- 2015-06-28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="H. Dieter Wilhelm" />
</head>
<body>
<div id="content">
<h1 class="title">Customisation of ANSYS-Mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Conventions used in <i>default.el</i></a></li>
<li><a href="#sec-3">3. Important Prerequisites</a>
<ul>
<li><a href="#sec-3-1">3.1. Finding ANSYS-Mode</a></li>
<li><a href="#sec-3-2">3.2. Installed ANSYS version and installation path</a></li>
</ul>
</li>
<li><a href="#sec-4">4. File suffixes for loading ANSYS-Mode</a>
<ul>
<li><a href="#sec-4-1">4.1. Macro files</a></li>
<li><a href="#sec-4-2">4.2. WorkBench generated input files</a></li>
<li><a href="#sec-4-3">4.3. The ANSYS Neutral file format</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Auto insertion of code</a></li>
<li><a href="#sec-6">6. Autoloading</a></li>
<li><a href="#sec-7">7. Outlining</a></li>
<li><a href="#sec-8">8. Highlighting (Colourisation)</a>
<ul>
<li><a href="#sec-8-1">8.1. Dynamic highlighting of variables</a></li>
<li><a href="#sec-8-2">8.2. Decoration levels</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Ansys version and paths</a></li>
<li><a href="#sec-10">10. Ansys processes</a>
<ul>
<li><a href="#sec-10-1">10.1. License server</a></li>
<li><a href="#sec-10-2">10.2. Solver options</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Customisations for GNU-Linux and Windows systems.
</p>

<p>
All the following code examples you will find in the file
<i>default.el</i>, which can be used as the configuration file for
ANSYS-Mode (after moving it e. g. to
<i>\/usr\/share\/emacs\/site-lisp\/</i> or
<i>c:\\EMACSINSTALLDIR\\site-lisp<br  />
</i>).  Yet this file is loaded <b>after</b>
Emacs' user configuration file <i>~\</i>.emacs/ (or <i>~\</i>.emacs.el/ or
<i>~\</i>.emacs.d\/init.el/, if any)!  When you intend to change any of the
following settings either with
</p>

<ol class="org-ol">
<li>Emacs' customisation system or
</li>
<li>changing them directly in your user configuration file,
</li>
</ol>

<p>
then you <b>must</b> either set the variable <code>inhibit-default-init</code> to <code>t</code>
like in the following line
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq inhibit-default-init t)
</pre>
</div>
<p>
in your configuration file or remove or rename <i>default.el</i> (or at
least its corresponding sections) otherwise clashing settings in
<i>.emacs</i> will be overwritten!
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Conventions used in <i>default.el</i></h2>
<div class="outline-text-2" id="text-2">
<p>
The comment sign in Emacs lisp is <code>;</code> (one semi-colon `;').  Textual
hints in <i>default.el</i> are indicated with DOUBLE semi-colons <code>;;</code>,
please uncomment there code lines with a SINGLE comment sign, when
appropriate.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Important Prerequisites</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Finding ANSYS-Mode</h3>
<div class="outline-text-3" id="text-3-1">
<p>
If the ANSYS-Mode files (the files with the suffix <i>.el</i>) are <b>not</b>
placed in a default Emacs load path.  Please see the variable
load-path .
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(describe-variable 'load-path)
</pre>
</div>

<p>
Or you can read about the load-path in the Emacs manual:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(info <span style="color: #8b2252;">"(emacs)Lisp Libraries"</span>)
</pre>
</div>

<p>
Then it is necessary to adjust the following way: Hint: The
directory site-lisp/ in the Emacs installation tree, for example, is
in its default load path.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #8b2252;">"C:\\DIRECTORY-PATH\\WHERE\\THE\\ANSYS-MODE\\FILES\\RESIDE"</span>)
</pre>
</div>
<p>
for example:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #8b2252;">"c:\\emacs\\ansys-mode"</span>)
</pre>
</div>
<p>
for a Windows system or
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #8b2252;">"/usr/local/src/emacs/ansys-mode"</span>)
</pre>
</div>
<p>
for a GNU-Linux system.
</p>
</div>
</div>
