default.el
;; Customisation file for ANSYS-Mode (GNU-Linux and Windows)

;; Copyright (C) 2006 - 2015 H. Dieter Wilhelm GPL V3

;; !!! `default.el' can be used as a configuration file (after moving
;; it e. g. to `/usr/share/emacs/site-lisp' or
;; `c:\\EMACS_INSTALLDIR\\site-lisp').  Yet this file is then loaded
;; AFTER Emacs' user configuration file `~/.emacs' (or `~/.emacs.el'
;; or `~/.emacs.d/init.el')!  If you intend to change the following
;; settings with Emacs' customisation system or changing them directly
;; in your configuration file, you must either set the variable
;; `inhibit-default-init' to `t' like in the following line

;; (setq inhibit-default-init t)

;; in your configuration file or remove or rename `default.el' (or at
;; least its corresponding sections) otherwise clashing settings in
;; your `.emacs' will be overwritten!!!

;;; CONVENTIONS

;; The comment sign is `;' (one semi-colon ;) Textual hints are
;; indicated with DOUBLE semi-colons `;;', optionally uncomment the
;; code lines with a SINGLE comment sign.

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		      ;; IMPORTANT PREREQUISITES
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; !!! If the ANSYS-Mode files (*.el) are NOT placed in a default
