doc/default.org
** Installed ANSYS version and installation path

For reading the ANSYS help in your browser it should be sufficient
to set at most the ANSYS version and the installation directory of
ANSYS (if they are differing from the defaults and restart Emacs
;-), the complete paths will be constructed with below information

#+BEGIN_SRC emacs-lisp
  (setq ansys-current-ansys-version "150")
  ;(setq ansys-current-ansys-version "161") ; "161" is the default
                                            ; in ANSYS-Mode 16.1.1
#+END_SRC					    
The installation path (what comes before the directory /ansys_inc/ on
Linux or /ANSYS Inc/ on Windows.
#+BEGIN_SRC emacs-lisp
(cond ((string= window-system "x")
        ;; This is an example of an installation directory on GNU-Linux
        (setq ansys-install-directory "/appl/")) ; default: "/"
       (t
        ;;This an example of an installation dir. on WINDOWS
        (setq ansys-install-directory "D:\\Ansys\\")) ; default: "C:\\Program Files\\"
#+END_SRC

If the paths of your ANSYS installation is completely differing from
the standard ANSYS directory structure, please see further below.

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		       ;; IMPORTANT PREREQUISIT
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; !!! If the ANSYS-Mode files (*.el) are NOT placed in a default
;; Emacs load-path it is necessary to adjust the following
;; variable:!!!  Hint: The directory site-lisp/ in the Emacs
;; installation tree, for example, is in its default load-path.

;(add-to-list 'load-path "C:\\DIRECTORY-PATH\\WHERE\\THE\\ANSYS-MODE\\FILES\\RESIDE")

;; for example: "c:\\emacs\\ansys-mode" for a Windows system or
;; "/usr/local/src/emacs/ansys-mode" for a GNU-Linux system.

;; For reading the ANSYS help in your browser it should be sufficient
;; to set at most the ANSYS version and the installation directory of
;; ANSYS (if they are differing from the defaults and restart Emacs
;; ;-), the complete paths will be constructed with below information

;(setq ansys-current-ansys-version "150")
;(setq ansys-current-ansys-version "161") ; default in ANSYS-Mode 16.1.1

;; conditional: Linux or Windows

;(cond ((string= window-system "x")
;        ;; This is an example of an installation directory on GNU-Linux
;        (setq ansys-install-directory "/appl/")) ; default: "/"
;       (t
;        ;;This an example of an installation dir. on WINDOWS
;        (setq ansys-install-directory "D:\\Ansys\\")) ; default: "C:\\Program Files\\"
;							 )

;; If the paths of your ANSYS installation is completely differing
;; from the normal ANSYS structures, please see below.

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			   ;; IMPORTANT END
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC

* File suffixes for loading ANSYS-Mode
Configure your file suffixes for which ANSYS mode is automatically
called for.
** Macro files
/.mac/ is the macro suffix of ANSYS i. e. these macro files can be
called in the ANSYS command prompt or APDL like a regular ANSYS
function (without the suffix /.mac/).

With the setting

#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.mac$" . ansys-mode))
#+END_SRC

files with the suffix /.mac/ will be opended in Emacs under
ANSYS-Mode.  Check the /example.mac/ file.
** WorkBench generated input files
/.dat/ and /.inp/ are WorkBench's solver input file suffixes.  See the
file /example.dat/.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.dat$" . ansys-mode))
  (add-to-list 'auto-mode-alist '("\\.inp\\'" . ansys-mode))
#+END_SRC
** The ANSYS Neutral file format
/.anf/ is the suffix for "ANSYS Neutral" files which include mostly
gometric data but also some APDL snippets. These files are used for
imports, see the file /example.anf/.

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.anf$" . ansys-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp :exports none :tangle yes
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; file suffixes for autoloading of ansys-mode, appropriate file
;; suffixes for which ANSYS mode is automatically called for

;; .mac is the macro suffix of ANSYS i. e. these macros can be called
;; in the ANSYS command prompt like a regular ANSYS function (without
;; the suffix .mac). See the file helper/example.mac
(add-to-list 'auto-mode-alist '("\\.mac$" . ansys-mode))

;; .dat and .inp are WorkBench's solver input file suffixes
;; See the file helper/example.dat
(add-to-list 'auto-mode-alist '("\\.dat$" . ansys-mode))
(add-to-list 'auto-mode-alist '("\\.inp\\'" . ansys-mode))

;; .anf is the suffix for "ANSYS Neutral" files which include mostly
;;  gometric data but also some APDL snippets. See the file
;;  helper/example.anf.
(add-to-list 'auto-mode-alist '("\\.anf$" . ansys-mode))
#+END_SRC

* Auto insertion of code
  With the following code block Emacs inserts automatically an outline
  of a code structure when creating a macro file (a file with the
  suffix /.mac/).
#+BEGIN_SRC emacs-lisp
(auto-insert-mode 1)	        ; insert automatically templates
(add-hook 'find-file-hook 'auto-insert) ; when opening new files
(setq auto-insert-query t)   ; aks for auto insertion of APDL template
(add-to-list 'auto-insert-alist
   '(ansys-mode . [ansys-skeleton-outline-template])) ;which template to insert
#+END_SRC

#+BEGIN_SRC emacs-lisp :exports none :tangle yes
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			  ;; Auto insertion
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; auto insertion stuff (when creating a new APDL file)

(auto-insert-mode 1)		        ; insert automatically templates
(add-hook 'find-file-hook 'auto-insert) ; when opening new files
(setq auto-insert-query t)   ; aks for auto insertion of APDL template
(add-to-list 'auto-insert-alist
  '(ansys-mode . [ansys-skeleton-outline-template])) ;which template to insert
#+END_SRC

