doc/default.html
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Installed ANSYS version and installation path</h3>
<div class="outline-text-3" id="text-3-2">
<p>
For reading the ANSYS help in your browser it should be sufficient
to set at most the ANSYS version and the installation directory of
ANSYS (if they are differing from the defaults and restart Emacs
;-), the complete paths will be constructed with below information
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ansys-current-ansys-version <span style="color: #8b2252;">"150"</span>)
<span style="color: #b22222;">;</span><span style="color: #b22222;">(setq ansys-current-ansys-version "161") ; "161" is the default</span>
                                          <span style="color: #b22222;">; </span><span style="color: #b22222;">in ANSYS-Mode 16.1.1</span>
</pre>
</div>
<p>
The installation path (what comes before the directory <i>ansys_inc</i> on
Linux or <i>ANSYS Inc</i> on Windows.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">cond</span> ((string= window-system <span style="color: #8b2252;">"x"</span>)
        <span style="color: #b22222;">;; </span><span style="color: #b22222;">This is an example of an installation directory on GNU-Linux</span>
        (setq ansys-install-directory <span style="color: #8b2252;">"/appl/"</span>)) <span style="color: #b22222;">; </span><span style="color: #b22222;">default: "/"</span>
       (t
        <span style="color: #b22222;">;;</span><span style="color: #b22222;">This an example of an installation dir. on WINDOWS</span>
        (setq ansys-install-directory <span style="color: #8b2252;">"D:\\Ansys\\"</span>)) <span style="color: #b22222;">; </span><span style="color: #b22222;">default: "C:\\Program Files\\"</span>
</pre>
</div>

<p>
If the paths of your ANSYS installation is completely differing from
the standard ANSYS directory structure, please see further below.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> File suffixes for loading ANSYS-Mode</h2>
<div class="outline-text-2" id="text-4">
<p>
Configure your file suffixes for which ANSYS mode is automatically
called for.
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Macro files</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<i>.mac</i> is the macro suffix of ANSYS i. e. these macro files can be
called in the ANSYS command prompt or APDL like a regular ANSYS
function (without the suffix <i>.mac</i>).
</p>

<p>
With the setting
</p>

<pre class="example">
(add-to-list 'auto-mode-alist '("\\.mac$" . ansys-mode))
</pre>

<p>
files with the suffix <i>.mac</i> will be opended in Emacs under
ANSYS-Mode.  Check the <i>example.mac</i> file.
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> WorkBench generated input files</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<i>.dat</i> and <i>.inp</i> are WorkBench's solver input file suffixes.  See the
file <i>example.dat</i>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #8b2252;">"\\.dat$"</span> . ansys-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #8b2252;">"\\.inp\\'"</span> . ansys-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> The ANSYS Neutral file format</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<i>.anf</i> is the suffix for "ANSYS Neutral" files which include mostly
gometric data but also some APDL snippets. These files are used for
imports, see the file <i>example.anf</i>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #8b2252;">"\\.anf$"</span> . ansys-mode))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Auto insertion of code</h2>
<div class="outline-text-2" id="text-5">
<p>
With the following code block Emacs inserts automatically an outline
of a code structure when creating a macro file (a file with the
suffix <i>.mac</i>).
</p>
<pre class="example">
(auto-insert-mode 1)	        ; insert automatically templates
(add-hook 'find-file-hook 'auto-insert) ; when opening new files
(setq auto-insert-query t)   ; aks for auto insertion of APDL template
(add-to-list 'auto-insert-alist
   '(ansys-mode . [ansys-skeleton-outline-template])) ;which template to insert
</pre>

<p>
#+BEGIN_SRC emacs-lisp :exports none :tangle yes
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                          ;; Auto insertion
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; auto insertion stuff (when creating a new APDL file)
</p>

<p>
(auto-insert-mode 1)                        ; insert automatically templates
(add-hook 'find-file-hook 'auto-insert) ; when opening new files
(setq auto-insert-query t)   ; aks for auto insertion of APDL template
(add-to-list 'auto-insert-alist
  '(ansys-mode . [ansys-skeleton-outline-template])) ;which template to insert
#+END_SRC             ;template
</p>
</div>
</div>
