default.el
;; Emacs load-path it is necessary to adjust the following
;; variable:!!!  Hint: The directory site-lisp/ in the Emacs
;; installation tree, for example, is in its default load-path.

;(add-to-list 'load-path "C:\\DIRECTORY-PATH\\WHERE\\THE\\ANSYS-MODE\\FILES\\RESIDE")

;; for example: "c:\\emacs\\ansys-mode" for a Windows system or
;; "/usr/local/src/emacs/ansys-mode" for a GNU-Linux system.


;; For reading the ANSYS help in your browser it should be sufficient
;; to set at most the ANSYS version and the installation directory of
;; ANSYS (if they are differing from the defaults and restart Emacs
;; ;-), the complete paths will be constructed with below information

;(setq ansys-current-ansys-version "150")
;(setq ansys-current-ansys-version "161") ; default in ANSYS-Mode 16.1.1

;; conditional: Linux or Windows

;(cond ((string= window-system "x")
;        ;; This is an example of an installation directory on GNU-Linux
;        (setq ansys-install-directory "/appl/")) ; default: "/"
;       (t
;        ;;This an example of an installation dir. on WINDOWS
;        (setq ansys-install-directory "D:\\Ansys\\")) ; default: "C:\\Program Files\\"
;							 )

;; If the paths of your ANSYS installation is completely differing
;; from the normal ANSYS structures, please see below.

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			   ;; IMPORTANT END
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		   ;; File suffixes for ANSYS-Mode
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; file suffixes for autoloading of ansys-mode, appropriate file
;; suffixes for which ANSYS mode is automatically called for

;; .mac is the macro suffix of ANSYS i. e. these macros can be called
;; in the ANSYS command prompt like a regular ANSYS function (without
;; the suffix .mac). See the file helper/example.mac
(add-to-list 'auto-mode-alist '("\\.mac$" . ansys-mode))

;; .dat and .inp are WorkBench's solver input file suffixes.
;; See the file helper/example.dat
(add-to-list 'auto-mode-alist '("\\.dat$" . ansys-mode))
(add-to-list 'auto-mode-alist '("\\.inp\\'" . ansys-mode))

;; .anf is the suffix for "ANSYS Neutral" files which include mostly
;;  gometric data but also some APDL snippets. See the file
;;  helper/example.anf.
(add-to-list 'auto-mode-alist '("\\.anf$" . ansys-mode))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			  ;; Auto insertion
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; auto insertion stuff (when creating a new APDL file)

(auto-insert-mode 1)		        ; insert automatically templates
(add-hook 'find-file-hook 'auto-insert) ; when opening new files
(setq auto-insert-query t)   ; aks for auto insertion of APDL template
(add-to-list 'auto-insert-alist '(ansys-mode . [ansys-skeleton-outline-template])) ;which
										   ;template

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		     ;; Autoloading of functions
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
