doc/default.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Autoloading</h2>
<div class="outline-text-2" id="text-6">
<p>
Below set of useful commands can be interactively called (with M-x
&#x2026;)  even when ANSYS Mode was not activated i.e. its lisp files not
yet loaded, with the following code.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload 'ansys-mode <span style="color: #8b2252;">"ansys-mode"</span> nil t)
(autoload 'ansys-customise-ansys <span style="color: #8b2252;">"ansys-mode"</span> <span style="color: #8b2252;">"Activate the function for </span>
<span style="color: #8b2252;"> calling a special ANSYS customisation buffer."</span> 'interactive)
(autoload 'ansys-abort-file <span style="color: #8b2252;">"ansys-mode"</span> <span style="color: #8b2252;">"Activate the function for  aborting ANSYS runs."</span> 'interactive)
(autoload 'ansys-display-error-file <span style="color: #8b2252;">"ansys-mode"</span> <span style="color: #8b2252;">"Activate the function for inspecting the ANSYS error file."</span> 'interactive)
(autoload 'ansys-start-ansys-help <span style="color: #8b2252;">"ansys-mode"</span> <span style="color: #8b2252;">"Activate the function for starting the ANSYS help browser."</span> 'interactive)
(autoload 'ansys-start-ansys <span style="color: #8b2252;">"ansys-mode"</span> <span style="color: #8b2252;">"Activate the function for starting the APDL interpreter under GNU-Linux or product launcher under Windows."</span> 'interactive)
(autoload 'ansys-license-status <span style="color: #8b2252;">"ansys-mode"</span> <span style="color: #8b2252;">"Activate the function for displaying ANSYS license status or starting a license utility."</span> 'interactive)
(autoload 'ansys-mode-version <span style="color: #8b2252;">"ansys-mode"</span> <span style="color: #8b2252;">"Show ANSYS-Mode's version number."</span> 'interactive)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Outlining</h2>
<div class="outline-text-2" id="text-7">
<p>
Activating outline minor mode for selectively hiding and unhiding
code sections:
</p>

<pre class="example">
(add-hook 'ansys-mode-hook 'ansys-outline-minor-mode) ;enable outlining
</pre>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Highlighting (Colourisation)</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Dynamic highlighting of variables</h3>
<div class="outline-text-3" id="text-8-1">
<p>
The following toggles a dynamics change of the highlighting: While
you are editing your new variable definitions highlighted and the
cursor position is shown in the parameter help overlay
</p>

<p>
Uncommenting the following might slow the editing of large .mac
files (but only when ansys-highlighting-level is set to 2, see
below).
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ansys-dynamic-highlighting-flag nil)
(setq ansys-dynamic-highlighting-flag t) <span style="color: #b22222;">;</span><span style="color: #b22222;">default</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Decoration levels</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Decoration levels 0,1,2 are available.  User variable highlighting is
only in level 2 available (statical, if above flag is not set), the
current default is 2
</p>

<pre class="example">
(setq ansys-highlighting-level 1) ; default: 2
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Ansys version and paths</h2>
<div class="outline-text-2" id="text-9">
<p>
Things you might have to configure if your ANSYS installation is
completely differing from default ANSYS installation path, as in the
example below:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ansys-help-program
    <span style="color: #8b2252;">"/appl/ansys_inc/16.1.0/v161/commonfiles/help/HelpViewer/ANSYSHelpViewer.exe"</span>)
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">normally it looks like this:</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">"/INSTALL_DIRECTORY/ansys_inc/v161/commonfiles/help/HelpViewer/ANSYSHelpViewer.exe"</span>
(setq ansys-help-path <span style="color: #8b2252;">"/appl/ansys_inc/16.1.0/v161/commonfiles/help/en-us/help/"</span>)
setq ansys-program <span style="color: #8b2252;">"/appl/ansys_inc/16.1.0/v161/ansys/bin/ansys161"</span>)
</pre>
</div>
</div>
</div>
