doc/default.org
** License server
   License server configuration: License servers (or license file
   name) specify even the default port for lmutil (since ANSYS V 12.0)
   on GNU-Linux GNU-Linux: License servers separated by colons (":"),
   1055 is the default port

#+BEGIN_SRC emacs-lisp
(setq ansys-license-file
  "1055@frlifl01.auto.contiwan.com:1055@frlifl02.auto.contiwan.com")
#+END_SRC
since ANSYS 12.0 there is an intermediate server for the communication
between flexlm and ANSYS WorkBench, 2325 is the default port.

#+BEGIN_SRC emacs-lisp
(setq ansys-ansysli-servers
   "2325@frlifl01.auto.contiwan.com:2325@frlifl02.auto.contiwan.com")
#+END_SRC

** Solver options
   Number of cores for the run, 2 does not require HPC licenses
   #+BEGIN_SRC emacs-lisp
   (setq ansys-no-of-processors 8) ;default: 2
   #+END_SRC

   Which license type to use for the solver
   #+BEGIN_SRC emacs-lisp
   (setq ansys-license "ansys") ;default: "struct"
   #+END_SRC

   ANSYS job name
   #+BEGIN_SRC emacs-lisp
   (setq ansys-job "otto"); default: "file"
   #+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		       ;; ANSYS processes stuff
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; license server configuration

      ;; GNU-Linux 64 bit

      ;; for starting the solver & ansys-license-status & ANSYS help 
;      (setq		     ;
;	;; license servers (or license file name)
;	;; specify even the default port for lmutil (since ANSYS V 12.0) on GNU-Linux
;	;; GNU-Linux: License servers separated by colons (":"), 1055 is the default port
;	ansys-license-file
;	"1055@frlifl01.auto.contiwan.com:1055@frlifl02.auto.contiwan.com"
;
;	;; since ANSYS 12.0 there is an intermediate server for
;	;; the communication between flexlm and ANSYS, 2325 is the default port
;	ansys-ansysli-servers
;	"2325@frlifl01.auto.contiwan.com:2325@frlifl02.auto.contiwan.com"
;	)
 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 
		 ;; options when starting the solver
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; Number of cores for the run, 2 does not require HPC licenses
;(setq ansys-no-of-processors 8) ;default: 2

;;  which license type to use for the solver
;(setq ansys-license "ansys") ;default: "struct"

;; ANSYS job name
;(setq ansys-job "otto"); default: "file"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			      ;; The End
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

#+END_SRC
----
# LOCAL variables:
# word-wrap: t
# show-trailing-whitespace: t
# indicate-empty-lines: t
# end:

