doc/default.html

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Ansys processes</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> License server</h3>
<div class="outline-text-3" id="text-10-1">
<p>
License server configuration: License servers (or license file
name) specify even the default port for lmutil (since ANSYS V 12.0)
on GNU-Linux GNU-Linux: License servers separated by colons (":"),
1055 is the default port
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ansys-license-file
  <span style="color: #8b2252;">"1055@frlifl01.auto.contiwan.com:1055@frlifl02.auto.contiwan.com"</span>)
</pre>
</div>
<p>
since ANSYS 12.0 there is an intermediate server for the communication
between flexlm and ANSYS WorkBench, 2325 is the default port.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ansys-ansysli-servers
   <span style="color: #8b2252;">"2325@frlifl01.auto.contiwan.com:2325@frlifl02.auto.contiwan.com"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Solver options</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Number of cores for the run, 2 does not require HPC licenses
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ansys-no-of-processors 8) <span style="color: #b22222;">;</span><span style="color: #b22222;">default: 2</span>
</pre>
</div>

<p>
Which license type to use for the solver
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ansys-license <span style="color: #8b2252;">"ansys"</span>) <span style="color: #b22222;">;</span><span style="color: #b22222;">default: "struct"</span>
</pre>
</div>

<p>
ANSYS job name
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ansys-job <span style="color: #8b2252;">"otto"</span>)<span style="color: #b22222;">; </span><span style="color: #b22222;">default: "file"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: H. Dieter Wilhelm (<a href="mailto:dieter@duenenhof-wilhelm.de">dieter@duenenhof-wilhelm.de</a>)</p>
<p class="date">Modification date: 2015-06-28 </p>
<p class="creator">Generated by Emacs 24.5.1 (Org mode 8.2.10) </p>
</div>
</body>
</html>
